# PolylineSegments Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolylineSegments Class
Members See Also
---
An output node that represents a tessellated polyline segments.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class PolylineSegments : IDisposable
```

Visual Basic
---
```text
Public Class PolylineSegments _
	Implements IDisposable
```

Visual C++
---
```text
public ref class PolylineSegments : IDisposable
```

# Remarks
See also: [!:Autodesk::Revit::DB::IModelExportContext::OnPolylineSegments].
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..PolylineSegments
# See Also
PolylineSegments Members
Autodesk.Revit.DB Namespace